## Simple Pendulum Data Cleaning Project

In [1]:
import numpy as np
import pandas as pd

In [2]:
# IMPORTANT -- index_col=FALSE is needed to create index column!!
# check each csv to see how many header rows need to be skipped
df = pd.read_csv("160.0CM.csv",sep=',',skiprows=23,header=(0),index_col=False)

In [3]:
df.head()

       0  5.013884  160.0 cm
0  0.001  5.012240       NaN
1  0.002  5.012569       NaN
2  0.003  5.014541       NaN
3  0.004  5.013884       NaN
4  0.005  5.012569       NaN

In [4]:
df_2 = df.drop(df.columns[2],axis=1)

In [5]:
# rename the headers so they can be manipulated more easily
df_2.columns=['Time','Voltage']

In [6]:
df_2.head()

    Time   Voltage
0  0.001  5.012240
1  0.002  5.012569
2  0.003  5.014541
3  0.004  5.013884
4  0.005  5.012569

In [7]:
df_2 = df_2.apply(pd.to_numeric)

Now, we drop everything except for the average times for each instance of the voltage dropping to less than 1 volt.

In [8]:
# This selects only the rows where the voltage meets my condition
minima = df_2[df_2['Voltage']<=1.0]

In [9]:
len(minima)
#minima.head()

174

In [10]:
length = 1.60
g = 9.8
period_exp = 2*np.pi*np.sqrt(length/g)
period_exp

2.538790250376209

In [11]:
start_time = minima.iloc[0,0] #this gives me the time of the first instance of pendulum passing through the photogate
start_time

0.244

In [12]:
bins = [(start_time-.05) + period_exp/2*n for n in range(0,11)] #change the end value to limit the number of bins
print(bins)

[0.194, 1.4633951251881046, 2.732790250376209, 4.002185375564314, 5.271580500752418, 6.540975625940523, 7.8103707511286276, 9.079765876316733, 10.349161001504838, 11.618556126692942, 12.887951251881047]

In [13]:
binned = pd.cut(minima['Time'], bins)

In [14]:
output = minima.groupby(binned)['Time'].agg(['count', 'sum', 'min', 'max', 'mean'])
output

                  count      sum    min    max   mean
Time
(0.194, 1.463]       29    7.482  0.244  0.272  0.258
(1.463, 2.733]       29   44.515  1.521  1.549  1.535
(2.733, 4.002]       29   81.200  2.786  2.814  2.800
(4.002, 5.272]       29  118.233  4.063  4.091  4.077
(5.272, 6.541]       29  154.918  5.328  5.356  5.342
(6.541, 7.81]        29  191.951  6.605  6.633  6.619
(7.81, 9.08]          0    0.000    NaN    NaN    NaN
(9.08, 10.349]        0    0.000    NaN    NaN    NaN
(10.349, 11.619]      0    0.000    NaN    NaN    NaN
(11.619, 12.888]      0    0.000    NaN    NaN    NaN

In [15]:
output2 = output[0:-4] #this has to be done manually b/c I can't get dropna() command to work correctly
output2

                count      sum    min    max   mean
Time
(0.194, 1.463]     29    7.482  0.244  0.272  0.258
(1.463, 2.733]     29   44.515  1.521  1.549  1.535
(2.733, 4.002]     29   81.200  2.786  2.814  2.800
(4.002, 5.272]     29  118.233  4.063  4.091  4.077
(5.272, 6.541]     29  154.918  5.328  5.356  5.342
(6.541, 7.81]      29  191.951  6.605  6.633  6.619

In [16]:
output2.to_csv ('output_1600.csv', index = True, header=True)